In [1]:
!pip install pandas

Requirement already satisfied: pandas in /home/shailesh/Desktop/VritEducation/.vritenv/lib/python3.10/site-packages (2.2.2)
Requirement already satisfied: pytz>=2020.1 in /home/shailesh/Desktop/VritEducation/.vritenv/lib/python3.10/site-packages (from pandas) (2024.2)
Requirement already satisfied: numpy>=1.22.4 in /home/shailesh/Desktop/VritEducation/.vritenv/lib/python3.10/site-packages (from pandas) (2.2.2)
Requirement already satisfied: tzdata>=2022.7 in /home/shailesh/Desktop/VritEducation/.vritenv/lib/python3.10/site-packages (from pandas) (2024.1)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/shailesh/Desktop/VritEducation/.vritenv/lib/python3.10/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in /home/shailesh/Desktop/VritEducation/.vritenv/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__

'2.2.2'

## Datatype of Pandas

1. DataFrame : 2D Table with rows and columns
2. Series : 1D array-like , can hold any data type such as integers, strings, floating-point numbers, and Python objects

## Creating DataFrame

In [4]:
data = {
    "name" : ["bob","charlie","aman"],
    "age": [25,30,35]
}
data

{'name': ['bob', 'charlie', 'aman'], 'age': [25, 30, 35]}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

      name  age
0      bob   25
1  charlie   30
2     aman   35

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
arr_data = np.array(
    [
        ["bob", 25],
        ["charlie", 30],
        ["aman" , 35]
    ]
)

In [9]:
pd.DataFrame(arr_data, columns=["Name", "age"])

      Name age
0      bob  25
1  charlie  30
2     aman  35

## Reading Data From Files

- `pd.read_csv(file_path, delimiter=',')`: Reads CSV (Comma Separated Value) file and returns a Pandas DataFrame
    - *file_path*: Path to csv file
    - *delimiter*: Symbol separating different columns (default=',')

In [10]:
df = pd.read_csv("Titanic_data.csv", header =0)

In [11]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
df.shape

(891, 12)

In [13]:
type(df)

pandas.core.frame.DataFrame

- `pd.read_json(file_path, delimiter=',')`: Reads Json file and returns a Pandas DataFrame
    - *file_path*: Path to csv file
    - *delimiter*: Symbol separating different columns (default=',')

In [14]:
j_df = pd.read_json("data.json")

In [15]:
j_df.head()

,userId,id,title,body
0,1,1,sunt aut facere repellat provident occaecati e...,quia et suscipit\nsuscipit recusandae consequu...
1,1,2,qui est esse,est rerum tempore vitae\nsequi sint nihil repr...
2,1,3,ea molestias quasi exercitationem repellat qui...,et iusto sed quo iure\nvoluptatem occaecati om...
3,1,4,eum et est occaecati,ullam et saepe reiciendis voluptatem adipisci\...
4,1,5,nesciunt quas odio,repudiandae veniam quaerat sunt sed\nalias aut...

## Accessing Data

In [16]:
name = df["Name"]
# names = df.Name

In [17]:
name.head(10)

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

In [18]:
type(name)

pandas.core.series.Series

In [19]:
name_age = df[["Name", "Age"]]

In [20]:
name_age.shape

(891, 2)

In [21]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')